"""
20장의 카드에서 특정 구간을 뒤집는다.

예제 1:
입력:
5 10
9 13
1 2
3 4
5 6
1 2
3 4
5 6
1 20
1 20
출력:
1 2 3 4 10 9 8 7 13 12 11 5 6 14 15 16 17 18 19 20

예제 2:
입력:
1 1
2 2
3 3
4 4
5 5
6 6
7 7
8 8
9 9
10 10
출력:
1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20

예제 3:
입력:
1 20
2 19
3 18
4 17
5 16
6 15
7 14
8 13
9 12
10 11
출력:
20 2 18 4 16 6 14 8 12 10 11 9 13 7 15 5 17 3 19 1

제약 조건:
1 ≤ a ≤ b ≤ 20
1 ≤ a_i ≤ b_i ≤ 20
"""

import sys

# [입력 처리]
nums = [i for i in range(1, 21)]

for _ in range(10):
    a, b = map(int, sys.stdin.readline().split())

# [핵심 로직]
    nums[a-1:b] = nums[a-1:b][::-1]

# [결과 출력]
print(*nums)
