"""
운동을 N분하는데 필요한 최소 시간을 출력한다.
맥박에 따라 운동을 할건지 휴식을 취할 것인지 결정한다.

예제 1:
입력: 5 70 120 25 15
출력: 10

예제 2:
입력: 100 50 100 5 200
출력: 109

예제 3:
입력: 1 60 70 11 11
출력: -1

예제 4:
입력: 200 50 200 150 1
출력: 30050

예제 5:
입력: 19 89 143 17 13
출력: 40

제약 조건:
1 ≤ N, T, R ≤ 200
50 ≤ m ≤ M ≤ 200
"""

import sys

# [입력 처리]
N, m, M, T, R = map(int, sys.stdin.readline().split())

# [핵심 로직]
if m+T > M:
    print(-1)
    quit()

time, X = 0, m
while N > 0:
    if X+T <= M:
        N -= 1
        X += T
    else:
        X = max(m, X-R)

    time += 1

# [결과 출력]
print(time)
