"""
치킨 3종류(양념, 후라이드, 반반)로 양념치킨 최소 X 마리, 후라이드치킨 최소 Y 마리를 구매하고자 할 때의 금액의 최솟값을 구한다.

예제 1:
입력: 1500 2000 1600 3 2
출력: 7900

예제 2:
입력: 1500 2000 1900 3 2
출력: 8500

예제 3:
입력: 1500 2000 500 90000 100000
출력: 100000000

제약 조건:
1 ≤ A, B, C ≤ 5,000
1 ≤ X, Y ≤ 100,000
"""

import sys

# [입력 처리]
a, b, c, x, y = map(int, sys.stdin.readline().split())

# [핵심 로직]
p1 = (a*x) + (b*y)
p2 = min(x, y) * (c*2)

if x > y:
    p2 += (x-y) * a
else:
    p2 += (y-x) * b

p3 = max(x, y) * (c*2)

# [결과 출력]
print(min(p1, p2, p3))